iDynamicsPackagesModules/Evaluations/legacyFiles/Cluster_10_Nodes/Policy1_eval_Graph_dynamics/Policy1_evaluated_data/wrk2_response_data/output_result_2025_03_18_07_52.txt
Running 2m test @ http://nginx-thrift.social-network.svc.cluster.local:8080
  4 threads and 100 connections

  Thread calibration: mean lat.: 34.261ms, rate sampling interval: 180ms
  Thread calibration: mean lat.: 45.957ms, rate sampling interval: 234ms
  Thread calibration: mean lat.: 36.719ms, rate sampling interval: 227ms
  Thread calibration: mean lat.: 33.018ms, rate sampling interval: 140ms

-----------------------------------------------------------------------
Test Results @ http://nginx-thrift.social-network.svc.cluster.local:8080 
  Thread Stats   Avg      Stdev     99%   +/- Stdev
    Latency    34.92ms   43.76ms 202.24ms   86.55%
    Req/Sec     6.62      6.09    25.00     85.47%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    9.22ms
 75.000%   46.08ms
 90.000%  113.28ms
 99.000%  202.24ms
 99.900%  335.10ms
 99.990%  350.72ms
 99.999%  350.72ms
100.000%  350.72ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       7.063     0.000000            1         1.00
       8.035     0.100000          306         1.11
       8.367     0.200000          614         1.25
       8.607     0.300000          919         1.43
       8.879     0.400000         1218         1.67
       9.215     0.500000         1521         2.00
       9.503     0.550000         1674         2.22
      20.495     0.600000         1826         2.50
      45.247     0.650000         1979         2.86
      45.695     0.700000         2135         3.33
      46.079     0.750000         2295         4.00
      46.271     0.775000         2363         4.44
      46.495     0.800000         2435         5.00
      46.879     0.825000         2513         5.71
      48.063     0.850000         2586         6.67
      90.047     0.875000         2662         8.00
     112.063     0.887500         2700         8.89
     113.279     0.900000         2739        10.00
     113.983     0.912500         2776        11.43
     114.623     0.925000         2817        13.33
     115.327     0.937500         2853        16.00
     115.775     0.943750         2871        17.78
     116.543     0.950000         2890        20.00
     118.847     0.956250         2909        22.86
     126.783     0.962500         2928        26.67
     141.439     0.968750         2947        32.00
     147.455     0.971875         2957        35.56
     150.015     0.975000         2966        40.00
     159.359     0.978125         2976        45.71
     164.351     0.981250         2986        53.33
     174.719     0.984375         2995        64.00
     181.247     0.985938         3000        71.11
     183.039     0.987500         3004        80.00
     194.431     0.989062         3009        91.43
     202.623     0.990625         3014       106.67
     203.775     0.992188         3020       128.00
     204.799     0.992969         3021       142.22
     208.511     0.993750         3024       160.00
     224.767     0.994531         3026       182.86
     225.663     0.995313         3028       213.33
     244.863     0.996094         3031       256.00
     247.423     0.996484         3032       284.44
     269.567     0.996875         3033       320.00
     287.487     0.997266         3034       365.71
     307.199     0.997656         3035       426.67
     310.527     0.998047         3037       512.00
     310.527     0.998242         3037       568.89
     326.911     0.998437         3038       640.00
     326.911     0.998633         3038       731.43
     335.103     0.998828         3039       853.33
     346.111     0.999023         3040      1024.00
     346.111     0.999121         3040      1137.78
     346.111     0.999219         3040      1280.00
     346.111     0.999316         3040      1462.86
     350.719     0.999414         3042      1706.67
     350.719     1.000000         3042          inf
#[Mean    =       34.922, StdDeviation   =       43.762]
#[Max     =      350.464, Total count    =         3042]
#[Buckets =           27, SubBuckets     =         2048]
-----------------------------------------------------------------------
  3334 requests in 2.00m, 2.25MB read
  Socket errors: connect 0, read 0, write 0, timeout 3409
Requests/sec:     27.77  
Transfer/sec:     19.21KB


Running 2m test @ http://nginx-thrift.social-network.svc.cluster.local:8080
  4 threads and 100 connections

  Thread calibration: mean lat.: 36.342ms, rate sampling interval: 180ms
  Thread calibration: mean lat.: 41.645ms, rate sampling interval: 227ms
  Thread calibration: mean lat.: 49.381ms, rate sampling interval: 231ms
  Thread calibration: mean lat.: 37.753ms, rate sampling interval: 228ms

-----------------------------------------------------------------------
Test Results @ http://nginx-thrift.social-network.svc.cluster.local:8080 
  Thread Stats   Avg      Stdev     99%   +/- Stdev
    Latency    39.37ms   51.00ms 251.26ms   86.67%
    Req/Sec     1.89      2.86    11.00     93.12%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    9.85ms
 75.000%   47.10ms
 90.000%  114.88ms
 99.000%  251.26ms
 99.900%  335.36ms
 99.990%  356.35ms
 99.999%  356.35ms
100.000%  356.35ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       7.371     0.000000            1         1.00
       8.631     0.100000           90         1.11
       8.959     0.200000          182         1.25
       9.223     0.300000          273         1.43
       9.455     0.400000          360         1.67
       9.847     0.500000          451         2.00
      10.703     0.550000          495         2.22
      45.663     0.600000          540         2.50
      46.335     0.650000          585         2.86
      46.751     0.700000          631         3.33
      47.103     0.750000          676         4.00
      47.295     0.775000          698         4.44
      47.487     0.800000          720         5.00
      47.999     0.825000          743         5.71
      49.567     0.850000          765         6.67
      91.903     0.875000          788         8.00
     113.855     0.887500          800         8.89
     114.879     0.900000          810        10.00
     115.583     0.912500          822        11.43
     116.159     0.925000          834        13.33
     117.951     0.937500          844        16.00
     120.959     0.943750          850        17.78
     142.591     0.950000          855        20.00
     158.975     0.956250          861        22.86
     163.583     0.962500          867        26.67
     172.287     0.968750          872        32.00
     175.743     0.971875          875        35.56
     188.159     0.975000          878        40.00
     207.999     0.978125          881        45.71
     214.015     0.981250          884        53.33
     225.791     0.984375          886        64.00
     232.703     0.985938          888        71.11
     245.503     0.987500          889        80.00
     251.263     0.989062          891        91.43
     252.415     0.990625          892       106.67
     281.087     0.992188          893       128.00
     281.343     0.992969          894       142.22
     284.415     0.993750          895       160.00
     293.375     0.994531          896       182.86
     293.375     0.995313          896       213.33
     308.735     0.996094          897       256.00
     308.735     0.996484          897       284.44
     331.007     0.996875          898       320.00
     331.007     0.997266          898       365.71
     331.007     0.997656          898       426.67
     335.359     0.998047          899       512.00
     335.359     0.998242          899       568.89
     335.359     0.998437          899       640.00
     335.359     0.998633          899       731.43
     335.359     0.998828          899       853.33
     356.351     0.999023          900      1024.00
     356.351     1.000000          900          inf
#[Mean    =       39.370, StdDeviation   =       50.996]
#[Max     =      356.096, Total count    =          900]
#[Buckets =           27, SubBuckets     =         2048]
-----------------------------------------------------------------------
  988 requests in 2.00m, 810.84KB read
  Socket errors: connect 0, read 0, write 0, timeout 5081
Requests/sec:      8.23  
Transfer/sec:      6.75KB


Running 2m test @ http://nginx-thrift.social-network.svc.cluster.local:8080
  4 threads and 100 connections

  Thread calibration: mean lat.: 31.843ms, rate sampling interval: 220ms
  Thread calibration: mean lat.: 35.716ms, rate sampling interval: 225ms
  Thread calibration: mean lat.: 38.011ms, rate sampling interval: 225ms
  Thread calibration: mean lat.: 29.389ms, rate sampling interval: 91ms

-----------------------------------------------------------------------
Test Results @ http://nginx-thrift.social-network.svc.cluster.local:8080 
  Thread Stats   Avg      Stdev     99%   +/- Stdev
    Latency    35.20ms   43.75ms 183.04ms   86.13%
    Req/Sec    11.62      9.41    43.00     74.61%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    8.93ms
 75.000%   45.69ms
 90.000%  112.57ms
 99.000%  183.04ms
 99.900%  349.95ms
 99.990%  353.54ms
 99.999%  354.30ms
100.000%  354.30ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       6.879     0.000000            1         1.00
       7.707     0.100000          525         1.11
       7.979     0.200000         1052         1.25
       8.247     0.300000         1574         1.43
       8.543     0.400000         2103         1.67
       8.927     0.500000         2613         2.00
       9.319     0.550000         2878         2.22
      44.063     0.600000         3136         2.50
      44.895     0.650000         3416         2.86
      45.311     0.700000         3667         3.33
      45.695     0.750000         3936         4.00
      45.951     0.775000         4056         4.44
      46.207     0.800000         4181         5.00
      46.655     0.825000         4314         5.71
      48.799     0.850000         4443         6.67
      90.239     0.875000         4573         8.00
     111.679     0.887500         4642         8.89
     112.575     0.900000         4710        10.00
     113.151     0.912500         4773        11.43
     113.727     0.925000         4842        13.33
     114.367     0.937500         4901        16.00
     114.751     0.943750         4936        17.78
     115.199     0.950000         4967        20.00
     115.775     0.956250         4998        22.86
     118.591     0.962500         5031        26.67
     136.447     0.968750         5064        32.00
     140.287     0.971875         5080        35.56
     147.199     0.975000         5096        40.00
     156.671     0.978125         5112        45.71
     162.047     0.981250         5129        53.33
     168.063     0.984375         5145        64.00
     172.031     0.985938         5153        71.11
     179.967     0.987500         5161        80.00
     182.527     0.989062         5169        91.43
     184.063     0.990625         5178       106.67
     201.727     0.992188         5186       128.00
     207.871     0.992969         5190       142.22
     219.519     0.993750         5194       160.00
     223.487     0.994531         5198       182.86
     228.479     0.995313         5202       213.33
     263.423     0.996094         5206       256.00
     268.799     0.996484         5208       284.44
     286.975     0.996875         5210       320.00
     307.199     0.997266         5212       365.71
     307.711     0.997656         5214       426.67
     345.855     0.998047         5216       512.00
     346.623     0.998242         5217       568.89
     349.439     0.998437         5218       640.00
     349.695     0.998633         5220       731.43
     349.695     0.998828         5220       853.33
     349.951     0.999023         5222      1024.00
     349.951     0.999121         5222      1137.78
     349.951     0.999219         5222      1280.00
     350.207     0.999316         5223      1462.86
     350.207     0.999414         5223      1706.67
     352.511     0.999512         5224      2048.00
     352.511     0.999561         5224      2275.56
     352.511     0.999609         5224      2560.00
     353.535     0.999658         5225      2925.71
     353.535     0.999707         5225      3413.33
     353.535     0.999756         5225      4096.00
     353.535     0.999780         5225      4551.11
     353.535     0.999805         5225      5120.00
     354.303     0.999829         5226      5851.43
     354.303     1.000000         5226          inf
#[Mean    =       35.200, StdDeviation   =       43.752]
#[Max     =      354.048, Total count    =         5226]
#[Buckets =           27, SubBuckets     =         2048]
-----------------------------------------------------------------------
  5748 requests in 2.00m, 3.82MB read
  Socket errors: connect 0, read 0, write 0, timeout 2292
Requests/sec:     47.89  
Transfer/sec:     32.59KB


Running 2m test @ http://nginx-thrift.social-network.svc.cluster.local:8080
  4 threads and 100 connections

  Thread calibration: mean lat.: 42.756ms, rate sampling interval: 226ms
  Thread calibration: mean lat.: 35.912ms, rate sampling interval: 223ms
  Thread calibration: mean lat.: 35.879ms, rate sampling interval: 225ms
  Thread calibration: mean lat.: 37.342ms, rate sampling interval: 220ms

-----------------------------------------------------------------------
Test Results @ http://nginx-thrift.social-network.svc.cluster.local:8080 
  Thread Stats   Avg      Stdev     99%   +/- Stdev
    Latency    35.69ms   43.88ms 194.30ms   85.31%
    Req/Sec    16.40      8.39    40.00     72.63%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    8.87ms
 75.000%   45.38ms
 90.000%  112.32ms
 99.000%  194.30ms
 99.900%  325.63ms
 99.990%  357.38ms
 99.999%  358.14ms
100.000%  358.14ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       6.691     0.000000            1         1.00
       7.543     0.100000          744         1.11
       7.823     0.200000         1487         1.25
       8.087     0.300000         2230         1.43
       8.383     0.400000         2975         1.67
       8.871     0.500000         3717         2.00
       9.759     0.550000         4079         2.22
      43.935     0.600000         4451         2.50
      44.575     0.650000         4835         2.86
      44.991     0.700000         5212         3.33
      45.375     0.750000         5569         4.00
      45.631     0.775000         5762         4.44
      45.983     0.800000         5942         5.00
      46.527     0.825000         6122         5.71
      63.423     0.850000         6303         6.67
      91.647     0.875000         6489         8.00
     111.679     0.887500         6582         8.89
     112.319     0.900000         6685        10.00
     112.767     0.912500         6771        11.43
     113.279     0.925000         6863        13.33
     113.791     0.937500         6956        16.00
     114.175     0.943750         7007        17.78
     114.559     0.950000         7048        20.00
     115.903     0.956250         7094        22.86
     118.015     0.962500         7137        26.67
     127.679     0.968750         7184        32.00
     136.063     0.971875         7210        35.56
     144.127     0.975000         7230        40.00
     153.727     0.978125         7253        45.71
     160.383     0.981250         7277        53.33
     167.423     0.984375         7300        64.00
     171.903     0.985938         7311        71.11
     181.247     0.987500         7326        80.00
     184.063     0.989062         7334        91.43
     201.855     0.990625         7346       106.67
     211.583     0.992188         7358       128.00
     223.871     0.992969         7363       142.22
     240.127     0.993750         7369       160.00
     245.503     0.994531         7375       182.86
     252.031     0.995313         7381       213.33
     266.239     0.996094         7387       256.00
     267.263     0.996484         7389       284.44
     285.183     0.996875         7392       320.00
     287.743     0.997266         7395       365.71
     305.663     0.997656         7398       426.67
     306.687     0.998047         7401       512.00
     307.455     0.998242         7403       568.89
     308.223     0.998437         7404       640.00
     309.503     0.998633         7405       731.43
     312.063     0.998828         7407       853.33
     325.631     0.999023         7408      1024.00
     328.447     0.999121         7409      1137.78
     347.135     0.999219         7410      1280.00
     347.135     0.999316         7410      1462.86
     349.695     0.999414         7411      1706.67
     351.743     0.999512         7412      2048.00
     351.743     0.999561         7412      2275.56
     355.583     0.999609         7413      2560.00
     355.583     0.999658         7413      2925.71
     355.583     0.999707         7413      3413.33
     357.375     0.999756         7414      4096.00
     357.375     0.999780         7414      4551.11
     357.375     0.999805         7414      5120.00
     357.375     0.999829         7414      5851.43
     357.375     0.999854         7414      6826.67
     358.143     0.999878         7415      8192.00
     358.143     1.000000         7415          inf
#[Mean    =       35.689, StdDeviation   =       43.881]
#[Max     =      357.888, Total count    =         7415]
#[Buckets =           27, SubBuckets     =         2048]
-----------------------------------------------------------------------
  8119 requests in 2.00m, 5.88MB read
  Socket errors: connect 0, read 0, write 0, timeout 1535
Requests/sec:     67.64  
Transfer/sec:     50.19KB